{
  "cmh": {
    "image_project": "casos_exito/cmh/portada.jpg",
    "name_project": "CMH",
    "client": "Previred",
    "short_description": "Duplicamos la conversión de la app mejorando la experiencia de los usuarios.",
    "description": "<p>PreviRed necesitaba de un partner en el proceso de implementación de mejoras funcionales al sistema que registra el histórico de movimientos de AFP. Durante el proyecto, detectamos que podíamos realizar mejoras extras orientadas a facilitar el proceso de desarrollo y pruebas del sistema.</p>",
    "result": "<p>Disminución en 99% el tiempo de generación de los instaladores del sistema.</p>",
    "challenge": "<p>Se realizan una serie de mejoras al sistema actual. Junto con las modificaciones a realizar se detectó que uno de los procesos tenía tiempos de respuesta altos, lo cual hacía aún más difícil realizar las pruebas por cada tarea. Como parte de las mejoras, <strong>se realizó un análisis y modificación del código fuente involucrado, logrando un descenso significativo en los tiempos de respuesta de 4hrs a 15 min</strong> (en el caso más complejo).</p><p>Por otra parte, <strong>para disminuir la probabilidad de errores, se automatizó la generación de instaladores</strong> y así, las entregas al cliente para sus diferentes ambientes se hicieron de forma transparente. <strong>En menos de 1 minuto se genera el zip con todo lo necesario.</strong></p><p>Con lo anterior, el equipo se pudo enfocar en lo realmente importante, se logró mejorar la experiencia de quienes debían certificar la calidad del sistema, se disminuyeron las incidencias reportadas y se mejoró la experiencia de los usuarios finales de nuestro cliente.</p>",
    "process": "<p>Para abordar este proyecto se realizaron reuniones de trabajo con el objetivo de: entender el problema en cuestión, familiarizarnos con el lenguaje de negocio y recibir de primera fuente los requerimientos. El registro y seguimiento de las tareas se realizó a través del sistema de gestión de requerimientos provisto por el cliente, en este caso Jira, lo cual permitió registrar avances, comentarios e información relevante para cada una de las tareas.</p><p>Nuestro equipo de desarrollo realizó mejoras adicionales, las que si bien no estaban dentro del requerimiento inicial, permitían facilitar el proceso de desarrollo: la generación de pruebas unitarias que respaldaran funcionalidad, la disminución de los tiempos de respuesta de un proceso específico y la automatización de la generación de instaladores por ambiente.</p><p>Por último, se destaca la comunicación directa con el usuario, el rol facilitador de los jefe de proyectos involucrados y la participación desde el comienzo del equipo de QA de nuestro cliente, el cual finalmente realizaría la recepción del sistema y validaría su paso a producción. La suma de esto permitió que el proceso fuera fluido y eficiente.</p>",
    "testimony": {
      "testimony_picture": "casos_exito/cmh/carolina.jpg",
      "testimony_name": "Carolina Rojas",
      "testimony_ocupation": "Jefe de Desarrollo, Gerencia Comercial",
      "testimony_text": "Trabajar con el equipo Continuum en el proyecto CMH fue una experiencia muy grata. Desde el principio se destacaron por la calidad de su trabajo, conocimientos tecnológicos, capacidad de gestión y aporte de valor al negocio, factores difícil de encontrar hoy en día en un proveedor. Lograron adaptarse rápidamente a nuestra metodología de desarrollo junto con enriquecerla logrando un trabajo conjunto fluido y eficiente, finalizando con éxito."
    }
  },
  "premiazos": {
    "image_project": "casos_exito/premiazos/portada.jpg",
    "name_project": "Premiazos",
    "client": "Infopáginas",
    "short_description": "Diseñamos la experiencia e implementamos la nueva versión de aplicación móvil de Premiazos, una aplicación de fidelización para comercios en Puerto Rico. La versión 2.0 responde a la necesidad de aumentar la cantidad de usuarios que la utilizan y ser más atractiva para sumar nuevos comercios en convenio.",
    "description": "<p>Diseñamos la experiencia e implementamos la nueva versión de aplicación móvil de Premiazos, una aplicación de fidelización para comercios en Puerto Rico. La versión 2.0 responde a la necesidad de aumentar la cantidad de usuarios que la utilizan y ser más atractiva para sumar nuevos comercios en convenio</p>",
    "result": "<p> Aumentar en un 60% en el número de usuarios de la aplicación.</p> <p>La nueva versión de Premiazos, busca aumentar el número de usuarios, mejorar la experiencia en notificaciones y segmentar el público al cuál se necesita notificar.</p> <p>Aumentar en un 45% los comercios en convenio.</p> El objetivo era mejorar la app premiazos para hacerlo más atractivo a comercios (especialmente cadenas) después del éxito del MVP que tenían hace un tiempo y que fue realizado con Shoutem (pero que limitaba severamente las funcionalidades futuras) </p>",
    "challenge": "<p>Infopaginas necesitaba realizar el proceso de diseño de experiencia junto a un proveedor que supiera de tecnología y entendiera su modelo de negocios. Nuestro principal desafío fue <strong>velar por la factibilidad técnica de lo que estábamos diseñando y conectar con los objetivos</strong> que tenía Infopaginas para hacer su app 2.0.</p>",
    "process": "<p>Realizamos un proceso de co-diseño e implementación 100% remoto y con alcance variable, utilizamos la metodología Design Sprint de Google, adaptada para trabajar con empresas y aprovechar al máximo los tiempos de nuestro cliente sin que someterlo extensas jornadas de co-creación.<p>Para conectar de forma fluida el diseño al desarrollo, lo hicimos a través de historias de usuario que escribimos y priorizamos en equipo (si,nuestro cliente también escribió historias), para así invertir el tiempo disponible en aquello que era factible, aportaba valor y que era posible incluir en el tiempo que teníamos disponible.</p><p>Aprovechamos las herramientas disponibles para realizar el proceso de forma colaborativa y remota, tales como: www.mural.co (Design Sprints, votación), Sketch para las interfaces e Invision para el prototipo</p>"
  },
  "acperforaciones": {
    "image_project": "casos_exito/acperforaciones/home-option.jpg",
    "name_project": "Sistema de Gestión",
    "client": "AC Perforaciones",
    "short_description": "Diseñamos e implementamos el sistema para registrar información de la operación en tiempo real.",
    "description": "<p>Desarrollamos e implementamos con éxito una solución que permite que la información de perforaciones sea ingresada en tablets en tiempo real, mediante una aplicación diseñada y desarrollada específicamente para este fin, junto a una plataforma web a la que estos tablets se sincronizan.</p>",
    "result": "<ul><li>Disminución en 99% el tiempo de generación de los instaladores del sistema.</li><li>Creación de reportes que permiten seguimiento y generación de estados de pago de forma automática, lo que disminuye los tiempos de gestión de pagos para la compañía.</li></ul>",
    "challenge": "<p>La compañía llevaba una información operacional deficiente y con cierto retraso. El desafío consistió en el diseño, construcción y puesta en marcha de un software que permitiese obtener información real, directa de la faena y actualizable a diario, sin que ello significara un impacto negativo en la cultura organizacional.</p>",
    "process": "<p>Implementamos un proceso ágil de desarrollo de software basado en historias de usuario creadas a partir de los requerimientos de ACPerforaciones. Las historias de usuario fueron creadas en conjunto, combinando el conocimiento del negocio de ACPerforaciones con la experiencia en tecnología y en diseño de experiencia de usuario de Continuum. Se realizaron entregas frecuentes (en ocasiones varias entregas semanales) que el cliente pudo validar rápidamente e incluso iniciar la operación antes de estar finalizados todos los módulos del proyecto.</p> <p>También fueron agregados nuevos requerimientos en medio del proceso, los que fueron priorizados e incorporados al mismo proceso de desarrollo, priorizando así la generación de valor de negocio por sobre contratos rígidos en que sólo se desarrolla lo inicialmente pensado.</p>",
    "testimony": {
      "testimony_picture": "casos_exito/acperforaciones/juan_correa_1.jpg",
      "testimony_name": "Juan José Correa",
      "testimony_ocupation": "Líder del proyecto AC Perforaciones",
      "testimony_text": "Durante el proceso de diseño y construcción del software, Continuum supo entender nuestras necesidades como cliente, y aún más, se adelantó a varias que nos hubieran surgido una vez que este estuviera operativo. Fue este último punto, basado en la experiencia en otros proyectos, lo que nos permitió avanzar rápidamente en una versión de producto final que estuviera a la altura de las necesidades de la compañía\"."
    }
  },
  "falabella": {
    "image_project": "casos_exito/falabella/proceso.png",
    "name_project": "Aplicación Falabella.com",
    "client": "Falabella",
    "short_description": "Creamos la premiada y exitosa app de Falabella.com.",
    "description": "<p>Usando nuestra metodología Lean UX ayudamos a Falabella a diseñar su aplicación Falabella.com como parte de su estrategia omnicanal, y considerando la creciente tendencia en el uso de dispositivos móviles. Una aplicación líder en su segmento de apps de grandes retailers, con cientos de miles de descargas, duplicando a su más cercano rival.</p>",
    "result": "<p>La app resultante de Falabella.com es líder en su segmento de apps de grandes retailers, con cientos de miles de descargar, duplicando a su más cercano rival. De igual forma, supera a su competencia directa en calificación de la app por parte de sus usuarios: más del 60% la califica con 5 estrellas.</p>",
    "challenge": "<p>Como parte de su estrategia omnicanal, y considerando la creciente tendencia del e-commerce, Falabella.com inició el proyecto de app móvil, contratando a Continuum para el diseño de la experiencia de usuario.</p>",
    "process": "<p>Usando nuestra metodología Lean UX ayudamos a alinear las necesidades de los distintos stakeholders del proyecto: marketing, operaciones y área digital (entre otros). También levantamos tempranamente las posibilidades y restricciones tecnológicas con especialistas móviles que participaron del proceso de diseño. Sobre esa base sólida se iteraron wireframes y luego diseños más completos. En tan solo 6 semanas después de iniciado el proyecto, Falabella.com contó con detallados diseños de cada pantalla de la app para ambas plataformas, junto con un prototipo funcional que permitía navegar las pantallas. Así, tanto los stakeholders como también el equipo de desarrollo pudieron palpar desde la primera fase del proyecto el resultado al que aspiraban, casi un año antes de que la app final viera la luz.</p>"
  },
  "coordinador-de-servicios": {
    "image_project": "casos_exito/coordinador/side-presentation.png",
    "name_project": "Coordinador de Servicios",
    "client": "Previred",
    "short_description": "Simplificamos los traspasos de AFP online.",
    "description": "<p>Con un plazo de implementación acotado a 5 meses, la superintendencia de AFP instruye a <strong>la industria que permitan el cambio de AFP 100% online a sus afiliados.</strong> Previred, en su rol de apoyo a las AFP, inicia el proyecto “Coordinador de servicios”. El coordinador  busca simplificar dramáticamente la implementación del traspaso a cada una de las AFP, ya que al actuar como un bus de servicios <strong>las AFP se integran él una vez</strong> y con ello el coordinador se encarga de gestionar con las otras AFP la búsqueda, validación y solicitud de traspaso si así corresponde.</p>",
    "result": "<p>El Coordinador de Servicios cumplió con creces los plazos estipulados por la superintendencia y por los participantes del proceso, pasando a producción en Septiembre de 2015.</p>",
    "challenge": "<p>En un plazo de 5 meses, implementar un servicio que cumpliera con los estándares de calidad y SLA establecidos, además de ser robusto para que el servicio entregado a cada AFP fuese óptimo.</p> <p>Algunas consideraciones importantes del proyecto:</p> <p><ol> <li>Múltiples y variados usuarios y stakeholders, que incluyen los equipos funcionales y técnicos de cada una de las 5 AFPs.</li> <li>Necesidad de dar visibilidad a las áreas de negocio y técnicas acerca de los requerimientos y respuestas generadas a través de servicios.</li> <li>Contar con mecanismos que permitieran adelantarse a problemas, dados los plazos del proyecto</li> <li>La solución debía dar un buen servicio (SLA) a cada AFP, independiente del nivel de carga y de problemas en respuestas por parte de otras AFPs.</li> </ol></p>",
    "process": "<p>En conjunto Previred y Continuum desarrollaron especificaciones tempranas de los protocolos de comunicación entre el coordinador y las AFPs. Especificaciones que no se quedaron sólo en el papel: a partir de estas especificaciones se implementaron servicios dummy y pruebas automatizadas para asegurar la calidad de nuestros entregables, independientemente de las entregas que debían hacer las AFPs. Este punto fue clave para hacer buen uso de los tiempos de cada miembro del equipo y no esperar hasta el momento de la integración de todos los entregables de cada AFP para encontrar potenciales problemas. </p> <p>Otro punto clave fue <strong>considerar desde un inicio un diseño robusto a los posibles cuellos de botella o problemas temporales</strong> en los servicios provistos por las AFP.</p> <p>Desde el punto de vista de la gestión, <strong>se privilegió la comunicación directa que permitiera tomar decisiones</strong> rápidamente cuando fuera necesario, para mantener el proyecto dentro de los estrechos plazos establecidos y así <strong>alcanzar el objetivo común: proveer un servicio de calidad y generar un producto del cual nos sintiéramos orgullosos.</strong></p>",
    "testimony": {
      "testimony_picture": "casos_exito/cmh/carolina.jpg",
      "testimony_name": "Carolina Rojas",
      "testimony_ocupation": "Jefe de Desarrollo, Gerencia Comercial",
      "testimony_text": "Es gracias al trabajo de equipo realizado en conjunto con nuestro proveedor <strong>pudimos cumplir con los objetivos y plazos establecidos, permitiéndonos incluso espacio para mejorar la funcionalidad original.</strong> Desde su puesta en marcha blanca, el coordinador está en operación sin caída alguna, fijando un estándar de operación del más alto nivel\"."
    }
  },
  "totem-metro-de-santiago": {
    "image_project": "casos_exito/metro_totem_autoatencion/portada.jpg",
    "name_project": "Tótem autoatención",
    "client": "Metro de Santiago",
    "short_description": "Diseñamos la experiencia para el tótem de autoatención de las nuevas líneas 3 y 6 de Metro.",
    "description": "<p>Diseñamos la experiencia para el tótem de autoatención de las nuevas líneas 3 y 6 de Metro, las cuales al ser completamente automáticas <strong>requieren proveer de módulos de autoatención</strong> que resuelvan las dudas de los pasajeros.</p>",
    "challenge": "<p><strong>Las nuevas líneas del metro son completamente automáticas</strong> por lo cual <strong>el personal de asistencia será menor en comparación a las líneas más antiguas</strong> de la red. Es por esto que <strong>se busca poner a disposición de los usuarios módulos de autoatención</strong>, donde los usuarios del transporte público puedan realizar de manera rápida y efectiva diversas consultas sin la necesidad de recurrir al personal de Metro.</p> <p>Por otra parte, el proyecto implicó un desafío en la gestión debido al número de stakeholders involucrados y que el equipo técnico se encontraba casi en su totalidad en España (proveedor de desarrollo).</p>",
    "process": "<p>Usamos la metodología Lean/Agile llamada Design Sprint de Google, adaptada para entornos enterprise. Esta consiste en realizar fases de validación por semanas (de 5 días corridos), persiguiendo 5 objetivos principales: Enfocarse en las verdaderas necesidades de los usuarios, reducir al mínimo los costos de malas decisiones, maximizar el aprendizaje, identificar las oportunidades de mejora y alinear a todos los stakeholders en una solución.</p> <p>Al final de cada sprint, con el prototipo \"realista\" logramos validar con una muestra cualitativa de usuarios, las hipótesis planteadas. Mientras nos encontrábamos validando, nuestro prototipo realista fue de cartulina, lo que nos facilitó iterar rápido y barato.</p> <p>Todos los insights que entregan las pruebas con usuarios, se aplican sobre el prototipo, transformándose éste en el documento base oficial del desarrollo del primer MVP o release.</p> <p>Realizamos 3 sprints, donde nos enfocamos en las diferentes líneas de interacción que tienen los usuarios para realizar diferentes operaciones dentro del tótem.</p>"
  },
  "recorrido": {
    "image_project": "casos_exito/recorrido/portada-recorrido.png",
    "name_project": "Recorrido",
    "client": "Recorrido",
    "short_description": "Duplicamos la conversión de la app mejorando la experiencia de los usuarios.",
    "description": "<p><strong>Realizamos el diseño de experiencia para la app</strong> de comparación y compra de pasajes de bus <a href=\"https://www.recorrido.cl/es\" target=\"_blank\" class=\"enlace\">Recorrido.cl</a>, donde no sólo es posible encontrar las mejores alternativas de pasaje, también cuenta con un sistema de pasajes digitales para algunas de las compañías que son parte de este sistema.</p>",
    "result": "<ul><li>El doble de conversión en la app móvil sobre la web móvil</li><li>Más del triple de usuarios únicos después del proceso UX</li><li>10 veces más búsquedas mensuales que las registradas previo a la UX</li><li>Disminución de un 80% en los tiempos de entreda de resultados</li></ul>",
    "challenge": "<p><strong><a href=\"https://www.recorrido.cl/es\" target=\"_blank\" class=\"enlace\">Recorrido.cl</a> resuelve los 3 problemas que tienen la mayoría de las personas que viajan en bus:</strong></p> <p><ul><li>Asegurarse que están comprando el pasaje más barato </li><li>Cuánto tardará realmente el viaje</li><li>Que viajarán cómodos</li></ul></p> <p>Todo esto sin la necesidad de ir a las oficinas o terminal de bus para averiguarlo. </p> <p>En base a estas necesidades detectadas, <strong>nos propusimos disminuir los tiempos de entrega de los resultados, entregar la información relevante al viaje y ofrecer una experiencia amigable.</strong> Para llegar allí, destinamos gran parte del proceso en la investigación de usuarios, entendiendo en profundidad sus necesidades y dolores para entregar la mejor solución posible. Todo este proceso lo realizamos sin dejar de lado el negocio de <a href=\"https://www.recorrido.cl/es\" target=\"_blank\" class=\"enlace\">Recorrido.cl</a> para encontrar el equilibrio que se refleja en el diseño resultante.</p>",
    "process": "<p>El proceso se compuso en 3 partes. Primero se realizó una etapa de investigación de usuarios, donde conversamos con personas que viajan frecuentemente en bus. En una segunda etapa definimos y estructuramos el contenido, mapa de navegación e interacciónes. Y finalmente pasamos a la etapa de look and feel, donde definimos la interfaz de la app móvil para cada sistema operativo.</p>"
  }
}